In [2]:
import pandas as pd
import numpy as np

In [41]:
data_emp    = {'name':['suresh','ramesh','alice','bob','mahesh','virat','sachin','gill','shubham','sonam','jagu','ishan','kisan','harry','sundhar','dulqar salman'],
               'age': [21,23,23,24,26,32,np.nan,45,32,np.nan,34,34,41,42,23,np.nan],
               'salary':[10000,30000,32000,20000,29000,45000,34000,10000,21000,10020,38000,23000,23900,21000,45000,30000]}
df = pd.DataFrame(data_emp)

In [4]:
df['age'].fillna(25,inplace = True)

In [5]:
df['age'].count()

np.int64(16)

In [6]:
len(df['age'])

16

In [7]:
df['department'] = [
    'HR','HR','Finance','Finance','IT','IT','Sales','Sales',
    'HR','Finance','IT','Sales','HR','Finance','IT','Sales'
]

In [8]:
df

             name   age  salary department
0          suresh  21.0   10000         HR
1          ramesh  23.0   30000         HR
2           alice  23.0   32000    Finance
3             bob  24.0   20000    Finance
4          mahesh  26.0   29000         IT
5           virat  32.0   45000         IT
6          sachin  25.0   34000      Sales
7            gill  45.0   10000      Sales
8         shubham  32.0   21000         HR
9           sonam  25.0   10020    Finance
10           jagu  34.0   38000         IT
11          ishan  34.0   23000      Sales
12          kisan  41.0   23900         HR
13          harry  42.0   21000    Finance
14        sundhar  23.0   45000         IT
15  dulqar salman  25.0   30000      Sales

In [9]:
df.loc[df['department'] == 'HR','salary'] = df['salary']  + 50000

In [10]:
df

             name   age  salary department
0          suresh  21.0   60000         HR
1          ramesh  23.0   80000         HR
2           alice  23.0   32000    Finance
3             bob  24.0   20000    Finance
4          mahesh  26.0   29000         IT
5           virat  32.0   45000         IT
6          sachin  25.0   34000      Sales
7            gill  45.0   10000      Sales
8         shubham  32.0   71000         HR
9           sonam  25.0   10020    Finance
10           jagu  34.0   38000         IT
11          ishan  34.0   23000      Sales
12          kisan  41.0   73900         HR
13          harry  42.0   21000    Finance
14        sundhar  23.0   45000         IT
15  dulqar salman  25.0   30000      Sales

In [11]:
df.groupby('department')['salary'].mean()

department
Finance    20755.0
HR         71225.0
IT         39250.0
Sales      24250.0
Name: salary, dtype: float64

In [12]:
df.groupby('age')['salary'].mean()

age
21.0    60000.000000
23.0    52333.333333
24.0    20000.000000
25.0    24673.333333
26.0    29000.000000
32.0    58000.000000
34.0    30500.000000
41.0    73900.000000
42.0    21000.000000
45.0    10000.000000
Name: salary, dtype: float64

In [13]:
df.groupby('age').agg({
    'salary':['min','max','mean'],
    'name': 'count'
})

     salary                       name
        min    max          mean count
age
21.0  60000  60000  60000.000000     1
23.0  32000  80000  52333.333333     3
24.0  20000  20000  20000.000000     1
25.0  10020  34000  24673.333333     3
26.0  29000  29000  29000.000000     1
32.0  45000  71000  58000.000000     2
34.0  23000  38000  30500.000000     2
41.0  73900  73900  73900.000000     1
42.0  21000  21000  21000.000000     1
45.0  10000  10000  10000.000000     1

In [14]:
df['level'] = df['salary'].apply(lambda x: 'High' if x > 30000 else 'Low')

In [15]:
df

             name   age  salary department level
0          suresh  21.0   60000         HR  High
1          ramesh  23.0   80000         HR  High
2           alice  23.0   32000    Finance  High
3             bob  24.0   20000    Finance   Low
4          mahesh  26.0   29000         IT   Low
5           virat  32.0   45000         IT  High
6          sachin  25.0   34000      Sales  High
7            gill  45.0   10000      Sales   Low
8         shubham  32.0   71000         HR  High
9           sonam  25.0   10020    Finance   Low
10           jagu  34.0   38000         IT  High
11          ishan  34.0   23000      Sales   Low
12          kisan  41.0   73900         HR  High
13          harry  42.0   21000    Finance   Low
14        sundhar  23.0   45000         IT  High
15  dulqar salman  25.0   30000      Sales   Low

In [18]:
df['employee'] = df['age'].apply(lambda x : 'Experience' if x > 25 else 'Fresher')

In [19]:
df

             name   age  salary department level    employee
0          suresh  21.0   60000         HR  High     Fresher
1          ramesh  23.0   80000         HR  High     Fresher
2           alice  23.0   32000    Finance  High     Fresher
3             bob  24.0   20000    Finance   Low     Fresher
4          mahesh  26.0   29000         IT   Low  Experience
5           virat  32.0   45000         IT  High  Experience
6          sachin  25.0   34000      Sales  High     Fresher
7            gill  45.0   10000      Sales   Low  Experience
8         shubham  32.0   71000         HR  High  Experience
9           sonam  25.0   10020    Finance   Low     Fresher
10           jagu  34.0   38000         IT  High  Experience
11          ishan  34.0   23000      Sales   Low  Experience
12          kisan  41.0   73900         HR  High  Experience
13          harry  42.0   21000    Finance   Low  Experience
14        sundhar  23.0   45000         IT  High     Fresher
15  dulqar salman  25.0   30000      Sales   Low     Fresher

In [22]:
df['bonus'] = df['salary'].apply(lambda x : x*0.1)

In [23]:
df

             name   age  salary department level    employee   bonus
0          suresh  21.0   60000         HR  High     Fresher  6000.0
1          ramesh  23.0   80000         HR  High     Fresher  8000.0
2           alice  23.0   32000    Finance  High     Fresher  3200.0
3             bob  24.0   20000    Finance   Low     Fresher  2000.0
4          mahesh  26.0   29000         IT   Low  Experience  2900.0
5           virat  32.0   45000         IT  High  Experience  4500.0
6          sachin  25.0   34000      Sales  High     Fresher  3400.0
7            gill  45.0   10000      Sales   Low  Experience  1000.0
8         shubham  32.0   71000         HR  High  Experience  7100.0
9           sonam  25.0   10020    Finance   Low     Fresher  1002.0
10           jagu  34.0   38000         IT  High  Experience  3800.0
11          ishan  34.0   23000      Sales   Low  Experience  2300.0
12          kisan  41.0   73900         HR  High  Experience  7390.0
13          harry  42.0   21000    Finance   Low  Experience  2100.0
14        sundhar  23.0   45000         IT  High     Fresher  4500.0
15  dulqar salman  25.0   30000      Sales   Low     Fresher  3000.0

In [32]:
df['tax'] = df['bonus'].apply(lambda x : 0 if x <2500 
                                   else 0.1*x if x<(3000 and 4000)
                                    else  x*0.12)

In [33]:
df

             name   age  salary department level    employee   bonus    tax
0          suresh  21.0   60000         HR  High     Fresher  6000.0  720.0
1          ramesh  23.0   80000         HR  High     Fresher  8000.0  960.0
2           alice  23.0   32000    Finance  High     Fresher  3200.0  320.0
3             bob  24.0   20000    Finance   Low     Fresher  2000.0    0.0
4          mahesh  26.0   29000         IT   Low  Experience  2900.0  290.0
5           virat  32.0   45000         IT  High  Experience  4500.0  540.0
6          sachin  25.0   34000      Sales  High     Fresher  3400.0  340.0
7            gill  45.0   10000      Sales   Low  Experience  1000.0    0.0
8         shubham  32.0   71000         HR  High  Experience  7100.0  852.0
9           sonam  25.0   10020    Finance   Low     Fresher  1002.0    0.0
10           jagu  34.0   38000         IT  High  Experience  3800.0  380.0
11          ishan  34.0   23000      Sales   Low  Experience  2300.0    0.0
12          kisan  41.0   73900         HR  High  Experience  7390.0  886.8
13          harry  42.0   21000    Finance   Low  Experience  2100.0    0.0
14        sundhar  23.0   45000         IT  High     Fresher  4500.0  540.0
15  dulqar salman  25.0   30000      Sales   Low     Fresher  3000.0  300.0

In [34]:
df['age_group'] = df['age'].apply(lambda x: 'young' if x <30 
                                        else 'middle' if x <40
                                        else 'senior')

In [35]:
df

,name,age,salary,department,level,employee,bonus,tax,age_group
0,suresh,21.0,60000,HR,High,Fresher,6000.0,720.0,young
1,ramesh,23.0,80000,HR,High,Fresher,8000.0,960.0,young
2,alice,23.0,32000,Finance,High,Fresher,3200.0,320.0,young
3,bob,24.0,20000,Finance,Low,Fresher,2000.0,0.0,young
4,mahesh,26.0,29000,IT,Low,Experience,2900.0,290.0,young
5,virat,32.0,45000,IT,High,Experience,4500.0,540.0,middle
6,sachin,25.0,34000,Sales,High,Fresher,3400.0,340.0,young
7,gill,45.0,10000,Sales,Low,Experience,1000.0,0.0,senior
8,shubham,32.0,71000,HR,High,Experience,7100.0,852.0,middle
9,sonam,25.0,10020,Finance,Low,Fresher,1002.0,0.0,young
10,jagu,34.0,38000,IT,High,Experience,3800.0,380.0,middle
11,ishan,34.0,23000,Sales,Low,Experience,2300.0,0.0,middle
12,kisan,41.0,73900,HR,High,Experience,7390.0,886.8,senior
13,harry,42.0,21000,Finance,Low,Experience,2100.0,0.0,senior
14,sundhar,23.0,45000,IT,High,Fresher,4500.0,540.0,young
15,dulqar salman,25.0,30000,Sales,Low,Fresher,3000.0,300.0,young

In [40]:
df['mask_name'] = df.apply(lambda row : row ['name'].upper() if row['age']>30
                             else  ['name'],axis = 1)